#include <iostream>
#include <vector>

int main()
{
    int n;
    std::cin >> n;                    //
    std::vector<bool> p(n + 1, true); // Создаем вектор p размером N + 1
    p[0] = p[1] = false;              // По определению 0 и 1 не являются простыми числами, поэтому сразу помечаем их как false (не простые).

    for (int i = 2; i * i <= n; ++i) // Внешний цикл. Перебираем потенциальные простые числа i, начиная с 2
        if (p[i])                    ////если текущее число i всё еще помечено как простое (true), значит, оно не было вычеркнуто ранее. Только для таких чисел имеет смысл вычеркивать их кратные.
            for (int j = i * i; j <= n; j += i)
                p[j] = false; // берем число i и вычеркиваем все числа, кратные ему, делая их false.

    for (int i = 2; i <= n; ++i) // Финальный по всему массиву. Мы просто идем от 2 до N и выводим те индексы i
        if (p[i])
            std::cout << i << " "; //,, у которых значение p[i] осталось равным true. Это и есть все простые числа.

    return 0;
}